Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/travel_abroad/passports/applying_for_or_renewing_an_irish_passport.html.txt.tmx
Source language: en
Languages: ga

source: If you are replacing a lost, stolen or damaged passport that was issued on or after 1 January 2005 and your new passport will issue in the same name, you do not have to supply the additional documentation
ga: Má tá pas a cailleadh, a goideadh nó a ndearnadh díobháil dó á ionadú agat a eisíodh an 1 Eanáir 2005 nó ina dhiaidh sin agus má eiseofar do phas nua san ainm céanna, ní gá duit an cháipéisíocht bhreise a sholáthar

source: Born in Ireland - you should include:
ga: Má rugadh in Éirinn thú - ba cheart duit na nithe seo a chur san áireamh:

source: • Your civil marriage or civil partnership certificate (if you have changed your surname)
ga: • Do theastas pósta shibhialta nó páirtnéireachta sibhialta (má d’athraigh tú do shloinne)

source: Born abroad to Irish-born parent - you should include:
ga: Má rugadh thar lear thú do thuismitheoir a rugadh in Éirinn - ba cheart duit na nithe seo a leanas a chur san áireamh:

source: • Your Irish-born parent’s birth certificate
ga: • Teastas breithe do thuismitheora a rugadh in Éirinn

source: • Your parents’ civil marriage certificate (if applicable)
ga: • Teastas pósta shibhialta do thuismitheoirí (má bhaineann)

source: Citizenship through foreign birth registration - you should include:
ga: Saoránacht trí chlárúchán breithe thar lear - ba cheart duit na nithe seo a leanas a chur san áireamh:

source: • Your foreign birth registration certificate
ga: • Do theastas clárúchán breithe thar lear

source: Born abroad and adopted under Irish law - you should include:
ga: Más rud é gur rugadh thar lear thú agus gur uchtaíodh faoi dhlí na hÉireann thú - ba cheart duit na nithe seo a leanas a chur san áireamh:

source: • Your certificate of entry in the Register of Intercountry Adoptions (If adopted abroad your adoption must be entered in the Register of Intercountry Adoptions)
ga: • Do theastas iontrála sa Chlár um Uchtuithe idir Thíortha (Má ghlac thar lear mór do uchtáil a iontráil i gClár um Uchtuithe idir Tíortha)

source: • Your adoptive Irish parent’s birth certificate or Irish passport
ga: • Teastas breithe nó pas Éireannach do thuismitheora Éireannaigh uchtála

source: Post-nuptial citizenship - you should include:
ga: Saoránacht iarphósta - ba cheart duit na nithe seo a leanas a chur san áireamh:

source: Citizenship through naturalisation - you should include:
ga: Saoránacht trí eadóirseacht - ba cheart duit na nithe seo a leanas a chur san áireamh:

source: If your documents are not in English you must also supply a certified English version, translated by a registered translator
ga: Mura bhfuil do chuid doiciméad i mBéarla, caithfidh tú leagan deimhnithe Béarla arna aistriú ag aistritheoir cláraithe a sholáthar

source: You may also be required to provide further information and/or attend for interview
ga: Is féidir go n-éileofar ort tuilleadh faisnéise a chur ar fáil agus/nó freastal ar agallamh freisin

source: Processing times for passports
ga: Amanna próiseála do phasanna

source: The Passport Service strongly recommends that you apply for your passport at least 6 weeks prior to your travel date
ga: Molann an tSeirbhís Pas go láidir go ndéanfá iarratas ar do phas ar a laghad 6 seachtaine roimh do dháta taistil

source: Applying through the Passport Express service ensures that properly completed renewal applications will normally be processed in 15 working days
ga: Trí iarratas a dhéanamh trí Sheirbhís na bPasanna Luais, cinntíonn sé go bpróiseálfar iarratais athnuachan chomhlánaithe laistigh de 15 lá oibre de ghnáth

source: For first-time applications you should allow at least 20 working days for your application to be processed
ga: I gcás iarratais chéaduaire, ba chóir duit ar a laghad 20 lá oibre a cheadú chun d'iarratas a phróiseáil

source: This period may be extended at certain times of the year due to increased application numbers
ga: D’fhéadfadh go sínfí an tréimhse sin ag tráthanna áirithe sa bhliain mar thoradh ar líon méadaithe iarratas

source: Check the Passport Service website for current processing time information
ga: Seiceáil láithreán Gréasáin na Seirbhíse Pasanna chun faisnéis reatha faoi amanna próiseála a fháil

source: If you are due to travel in less than 3 weeks you should apply in person to a Passport Office
ga: Ba cheart duit iarratas a dhéanamh go pearsanta chuig ceann ar bith d’Oifigí na bPasanna sa chás go mbeidh tú ag taisteal laistigh de 3 seachtaine

source: To apply in person at a Passport Office, you should book an appointment online
ga: D’fhonn iarratas a dhéanamh go pearsanta chuig ceann ar bith d’Oifigí na bPasanna, ba cheart duit coinne a chur in áirithe ar líne

source: If you require a passport urgently, you should contact the Passport Service
ga: Más rud é go dteastaíonn pas uait go práinneach, ba cheart duit dul i dteagmháil leis an tSeirbhís Pasanna

source: If living abroad, in general you should allow at least 6-8 weeks for the processing of your passport via your local embassy or consulate
ga: Má tá cónaí ort thar lear, ba cheart duit 6-8 seachtaine ar a laghad a fhágáil le haghaidh chun d’iarratas a phróiseáil tríd an ambasáid nó tríd an gconsalacht is cóngaraí duit

source: Tracking the progress of your passport application
ga: An dul chun cinn ar d’iarratas ar phas a rianú

source: The Passport Service provides a Passport Tracking Service
ga: Cuireann an tSeirbhís Pasanna Seirbhís um Rianú Pas ar fáil

source: This service allows you to check the status of your application online
ga: Ligeann an tseirbhís seo duit stádas d’iarratais a sheiceáil ar líne

source: In order to do this, you must have the application number from your form (available in the top left-hand corner of the form) to do this
ga: Chun amhlaidh a dhéanamh, ní mór duit an uimhir iarratais ó d’fhoirm (le fáil ag barr na foirme ar chlé) a bheith agat

source: When you receive your passport, you should sign it
ga: Nuair a fhaigheann tú do phas, ba chóir duit é a shíniú

source: In the case of a child’s passport, the child should sign it
ga: I gcás phas linbh, ba chóir don pháiste é a shíniú

source: If the child is not able to sign their name, it should be left blank
ga: Mura bhfuil an leanbh in ann a ainm a shíniú, ba cheart a pas a fhágáil bán

source: If applying from within the State, you should use Passport Express
ga: Ba cheart duit úsáid a bhaint as Seirbhís na bPasanna Luais más ag déanamh iarratais ó áit laistigh den Stát atá tú

source: Hand in your application at your nearest Service Plus Post Office
ga: Cuir d’iarratas isteach ag an Oifig Phoist ‘Service Plus’ is cóngaraí duit

source: If you have immediate travel plans or a necessity to travel for reasons of family emergency, contact a Passport Office
ga: Más rud é go bhfuil pleananna taistil láithrigh agat, nó go bhfuil gá le taisteal chun críche éigeandáil teaghlaigh agat, déan teagmháil le ceann ar bith d’Oifigí na bPasanna

source: If applying from outside the State, send the completed application to the nearest Irish embassy or consulate, or hand it in at the nearest participating Northern Ireland Post Office if using Passport Express
ga: Más rud é go bhfuil tú ag déanamh iarratais ó áit lasmuigh den Stát, seol an t-iarratas comhlánaithe chuig an ambasáid Éireannach nó chuig an gconsalacht Éireannach is cóngaraí duit, nó cuir isteach é ag an Oifig Phoist rannpháirteach is cóngaraí i dTuaisceart Éireann más ag úsáid Sheirbhís na bPasanna Luais atá tú

source: You can order birth, marriage, civil partnership and adoption certificates online from the HSE
ga: Is féidir leat teastas breithe, teastas pósta, teastas páirtnéireachta sibhialta agus teastas uchtála a ordú ar líne ó FSS

source: You can order a certificate of entry in the Register of Intercountry Adoptions from the Adoption Authority
ga: Is féidir leat teastas iontrála sa Chlár um Uchtuithe idir Thíortha a ordú ón Údarás Uchtála

source: Information on how to obtain a foreign birth registration certificate is available on the Department of Foreign Affairs and Trade website
ga: Tá faisnéis faoi conas teastas clárúchán breithe thar lear a fháil ar fáil ar láithreán Gréasáin na Roinne Gnóthaí Eachtracha agus Trádála
